
<details><summary>Show Plan</summary>

``` terraform
terraform
module.sdk_analysis.module.lambda.null_resource.docker_build: Refreshing state... [id=2486594553883197905]
module.sdk_analysis.module.ecs_task.null_resource.docker_build: Refreshing state... [id=494194448135757223]
module.sdk_analysis.aws_s3_bucket.upload_bucket: Refreshing state... [id=modl-sdk-upload]
module.sdk_analysis.aws_s3_bucket.analyzed_bucket: Refreshing state... [id=modl-sdk-analyzed]
module.downloads[0].aws_iam_role.downloads_role: Refreshing state... [id=s3_downloads_role]
module.sdk_analysis.aws_sqs_queue.sdk_queue_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/725604423866/modl-sdk-queue-deadletter]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z03799832ACKUNJ8IZDHB]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:725604423866:certificate/691b9483-8679-4d94-82e4-c53a2ff634fc]
module.sdk_analysis.module.ecs_task.aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:725604423866:cluster/modl-sdk_analysis-cluster]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_c: Refreshing state... [id=subnet-f2f246ad]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-641f6429]
module.sdk_analysis.module.ecs_task.aws_ecr_repository.ecr: Refreshing state... [id=modl-sdk_analysis]
module.sdk_analysis.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=modl-sdk_upload]
module.api.aws_iam_role.iam_for_lambda: Refreshing state... [id=modl-iam_for_lambda]
module.jupyter_notebook[0].aws_s3_bucket.jupyter: Refreshing state... [id=jupyter-sdk.curibio-modl.com]
module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk-analysis-logs: Refreshing state... [id=modl-sdk-analysis]
module.sdk_analysis.module.ecs_task.aws_default_vpc.default_vpc: Refreshing state... [id=vpc-c817d3b5]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-58d96f79]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-modl-server-access-logs]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecsTaskExecutionRole: Refreshing state... [id=modl-sdk_analysis-execution-task-role]
module.sdk_analysis.module.ecs_task.null_resource.docker_tag: Refreshing state... [id=134254638304935216]
module.sdk_analysis.module.lambda.null_resource.docker_tag: Refreshing state... [id=3333961761990155562]
module.sdk_analysis.module.lambda.null_resource.docker_push: Refreshing state... [id=7741002650169314064]
module.sdk_analysis.module.ecs_task.null_resource.docker_push: Refreshing state... [id=1966001569761004287]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_TXT]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_www_CNAME]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_862laeb5r7tfnxngc2mc_CNAME]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_A]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__github-challenge-curibio.www.curibio.com_TXT]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_MX]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio-modl.com"]: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__57b523665a1e9e3baef95f3dc85315ae.curibio-modl.com._CNAME]
module.api.aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=modl-iam_for_lambda-20210914183559514000000002]
module.sdk_analysis.aws_sqs_queue.sdk_upload_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/725604423866/modl-sdk-upload-queue]
module.jupyter_notebook[0].aws_cloudfront_distribution.jupyter_sdk_distribution: Refreshing state... [id=E2E51DTG2P23PH]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/modl-sdk-upload-lambda]
module.sdk_analysis.module.ecs_task.aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=modl-sdk_analysis-execution-task-role-20210910222144615700000001]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio-modl.com]
module.sdk_analysis.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=modl-sdk-upload]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role: Refreshing state... [id=modl-sdk_analysis-ecs_task_role]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=modl-sdk-upload-lambda]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-16 22:33:28 +0000 UTC]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-inline]
module.jupyter_notebook[0].aws_route53_record.jupyter_cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_jupyter-sdk.curibio-modl.com_CNAME]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-logs]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=modl-sdk-upload-lambda-20210913232924355100000003]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=modl-sdk-upload-lambda]
module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task: Refreshing state... [id=modl-sdk_analysis-ecs-task-definition]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=modl-sdk-upload-lambda-20210913232924341400000002]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio-modl.com]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1CI0FY7D89ZVE]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_downloads.curibio-modl.com_CNAME]
module.downloads[0].aws_iam_role_policy.s3_downloads: Refreshing state... [id=s3_downloads_role:s3_downloads_policy]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_apigatewayv2_api.lambda_gw will be created
  + resource "aws_apigatewayv2_api" "lambda_gw" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "modl-lambda-gw"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.api.aws_apigatewayv2_authorizer.lambda_gw_auth will be created
  + resource "aws_apigatewayv2_authorizer" "lambda_gw_auth" {
      + api_id                           = (known after apply)
      + authorizer_result_ttl_in_seconds = (known after apply)
      + authorizer_type                  = "JWT"
      + id                               = (known after apply)
      + identity_sources                 = [
          + "$request.header.Authorization",
        ]
      + name                             = "modl-lambda-gw-authorizer"

      + jwt_configuration {
          + audience = (known after apply)
          + issuer   = (known after apply)
        }
    }

  # module.api.aws_apigatewayv2_integration.get_auth_integration will be created
  + resource "aws_apigatewayv2_integration" "get_auth_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Get auth integration"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api.aws_apigatewayv2_integration.get_sdk_status_integration will be created
  + resource "aws_apigatewayv2_integration" "get_sdk_status_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Get SDK Status Integration"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api.aws_apigatewayv2_integration.sdk_upload_integration will be created
  + resource "aws_apigatewayv2_integration" "sdk_upload_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "SDK Upload Integration"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:725604423866:function:modl-sdk-upload-lambda/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api.aws_apigatewayv2_route.get_auth will be created
  + resource "aws_apigatewayv2_route" "get_auth" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /get_auth"
      + target             = (known after apply)
    }

  # module.api.aws_apigatewayv2_route.get_sdk_status will be created
  + resource "aws_apigatewayv2_route" "get_sdk_status" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /get_sdk_status"
      + target             = (known after apply)
    }

  # module.api.aws_apigatewayv2_route.sdk_upload will be created
  + resource "aws_apigatewayv2_route" "sdk_upload" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "POST /sdk_upload"
      + target             = (known after apply)
    }

  # module.api.aws_apigatewayv2_stage.lambda_gw_stage will be created
  + resource "aws_apigatewayv2_stage" "lambda_gw_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "modl-lambda-gw-stage"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.api.aws_cloudwatch_log_group.api_gw will be created
  + resource "aws_cloudwatch_log_group" "api_gw" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gw/modl-lambda-gw"
      + retention_in_days = 0
      + tags              = {
          + "Application" = "api-gw"
          + "Environment" = "modl"
        }
      + tags_all          = {
          + "Application" = "api-gw"
          + "Environment" = "modl"
        }
    }

  # module.api.aws_cognito_user_pool.lambda_gw_pool will be created
  + resource "aws_cognito_user_pool" "lambda_gw_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "modl-lambda-gw-pool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + lambda_config {
          + create_auth_challenge          = (known after apply)
          + custom_message                 = (known after apply)
          + define_auth_challenge          = (known after apply)
          + kms_key_id                     = (known after apply)
          + post_authentication            = (known after apply)
          + post_confirmation              = (known after apply)
          + pre_authentication             = (known after apply)
          + pre_sign_up                    = (known after apply)
          + pre_token_generation           = (known after apply)
          + user_migration                 = (known after apply)
          + verify_auth_challenge_response = (known after apply)

          + custom_email_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }

          + custom_sms_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }
        }

      + password_policy {
          + minimum_length                   = (known after apply)
          + require_lowercase                = (known after apply)
          + require_numbers                  = (known after apply)
          + require_symbols                  = (known after apply)
          + require_uppercase                = (known after apply)
          + temporary_password_validity_days = (known after apply)
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.api.aws_cognito_user_pool_client.lambda_gw_pool_client will be created
  + resource "aws_cognito_user_pool_client" "lambda_gw_pool_client" {
      + callback_urls                 = (known after apply)
      + client_secret                 = (sensitive value)
      + enable_token_revocation       = (known after apply)
      + explicit_auth_flows           = [
          + "USER_PASSWORD_AUTH",
        ]
      + id                            = (known after apply)
      + logout_urls                   = (known after apply)
      + name                          = "modl-lambda-gw-pool-client"
      + prevent_user_existence_errors = (known after apply)
      + refresh_token_validity        = 30
      + user_pool_id                  = (known after apply)
    }

  # module.api.aws_iam_role.iam_for_lambda must be replaced
-/+ resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::725604423866:role/modl-iam_for_lambda" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-09-14T18:35:58Z" -> (known after apply)
      ~ id                    = "modl-iam_for_lambda" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> (known after apply)
      ~ name                  = "modl-iam_for_lambda" -> "modl-iam-for-lambda" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2R4LE3C5FNAY4ECZL" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.api.aws_iam_role_policy_attachment.lambda_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_policy" {
      ~ id         = "modl-iam_for_lambda-20210914183559514000000002" -> (known after apply)
      ~ role       = "modl-iam_for_lambda" -> "modl-iam-for-lambda" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_lambda_permission.get_auth_lambda_permission will be created
  + resource "aws_lambda_permission" "get_auth_lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "modl-get-auth"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowGetAuthAPIInvoke"
    }

  # module.api.aws_lambda_permission.get_sdk_status_lambda_permission will be created
  + resource "aws_lambda_permission" "get_sdk_status_lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "modl-get-sdk-status"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowSDKStatusAPIInvoke"
    }

  # module.api.aws_lambda_permission.sdk_upload_lambda_permission will be created
  + resource "aws_lambda_permission" "sdk_upload_lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "modl-sdk-upload-lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowSDKUploadAPIInvoke"
    }

  # module.sdk_status_db.aws_dynamodb_table.sdk_analysis_statuses will be created
  + resource "aws_dynamodb_table" "sdk_analysis_statuses" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "upload_id"
      + id               = (known after apply)
      + name             = "modl-sdk-analysis-statuses"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "upload_id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # module.get_auth.module.lambda.aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "modl-get_auth"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.get_auth.module.lambda.null_resource.docker_build will be created
  + resource "null_resource" "docker_build" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "44373e14760ca357d3d24fc2b6ed5acf"
        }
    }

  # module.get_auth.module.lambda.null_resource.docker_push will be created
  + resource "null_resource" "docker_push" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "44373e14760ca357d3d24fc2b6ed5acf"
        }
    }

  # module.get_auth.module.lambda.null_resource.docker_tag will be created
  + resource "null_resource" "docker_tag" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "44373e14760ca357d3d24fc2b6ed5acf"
        }
    }

  # module.get_sdk_status.module.lambda.aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "modl-get_sdk_status"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.get_sdk_status.module.lambda.null_resource.docker_build will be created
  + resource "null_resource" "docker_build" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "4d7765f4a5b0f40de5dcf7d5512b6149"
        }
    }

  # module.get_sdk_status.module.lambda.null_resource.docker_push will be created
  + resource "null_resource" "docker_push" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "4d7765f4a5b0f40de5dcf7d5512b6149"
        }
    }

  # module.get_sdk_status.module.lambda.null_resource.docker_tag will be created
  + resource "null_resource" "docker_tag" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "4d7765f4a5b0f40de5dcf7d5512b6149"
        }
    }

  # module.sdk_analysis.module.ecs_task.data.aws_ecs_task_definition.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "main"  {
      ~ family          = "modl-sdk_analysis-ecs-task-definition" -> (known after apply)
      ~ id              = "arn:aws:ecs:us-east-1:725604423866:task-definition/modl-sdk_analysis-ecs-task-definition:1" -> (known after apply)
      ~ network_mode    = "awsvpc" -> (known after apply)
      ~ revision        = 1 -> (known after apply)
      ~ status          = "ACTIVE" -> (known after apply)
      ~ task_role_arn   = "arn:aws:iam::725604423866:role/modl-sdk_analysis-ecs_task_role" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_service.aws-ecs-service will be created
  + resource "aws_ecs_service" "aws-ecs-service" {
      + cluster                            = "arn:aws:ecs:us-east-1:725604423866:cluster/modl-sdk_analysis-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "modl-sdk_analysis-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:us-east-1:725604423866:task-definition/modl-sdk_analysis-ecs-task-definition:1"
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + subnets          = [
              + "subnet-58d96f79",
              + "subnet-641f6429",
              + "subnet-f2f246ad",
            ]
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_build must be replaced
-/+ resource "null_resource" "docker_build" {
      ~ id       = "494194448135757223" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "bbe51e3efa7173feef9014c8f9e38bed" -> "3e81ca9a4d89408d387f8c51f5039f6b"
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_push must be replaced
-/+ resource "null_resource" "docker_push" {
      ~ id       = "1966001569761004287" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "bbe51e3efa7173feef9014c8f9e38bed" -> "3e81ca9a4d89408d387f8c51f5039f6b"
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_tag must be replaced
-/+ resource "null_resource" "docker_tag" {
      ~ id       = "134254638304935216" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "bbe51e3efa7173feef9014c8f9e38bed" -> "3e81ca9a4d89408d387f8c51f5039f6b"
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_build must be replaced
-/+ resource "null_resource" "docker_build" {
      ~ id       = "2486594553883197905" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "2c903636dd9791b7f4b6af6a54334289" -> "d652cfa3edc00c171d6e5d5ccda9e915"
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_push must be replaced
-/+ resource "null_resource" "docker_push" {
      ~ id       = "7741002650169314064" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "2c903636dd9791b7f4b6af6a54334289" -> "d652cfa3edc00c171d6e5d5ccda9e915"
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_tag must be replaced
-/+ resource "null_resource" "docker_tag" {
      ~ id       = "3333961761990155562" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "2c903636dd9791b7f4b6af6a54334289" -> "d652cfa3edc00c171d6e5d5ccda9e915"
        }
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/modl-get-auth"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "modl-get-auth-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "modl-get-auth"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "modl-get-auth"
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Get auth tokens"
      + function_name                  = "modl-get-auth"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/modl-get-sdk-status"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "modl-get-sdk-status-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "modl-get-sdk-status"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "modl-get-sdk-status"
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Get upload/analysis status of files"
      + function_name                  = "modl-get-sdk-status"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline"  {
      ~ id      = "195526559" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::modl-sdk-upload/*"
                      - Sid      = "s3put"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "2731599537" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:725604423866:log-group:/aws/lambda/modl-sdk-upload-lambda:*:*",
                          - "arn:aws:logs:us-east-1:725604423866:log-group:/aws/lambda/modl-sdk-upload-lambda:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-inline"
        name      = "modl-sdk-upload-lambda-inline"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::modl-sdk-upload/*"
                      - Sid      = "s3put"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-logs"
        name      = "modl-sdk-upload-lambda-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:725604423866:log-group:/aws/lambda/modl-sdk-upload-lambda:*:*",
                          - "arn:aws:logs:us-east-1:725604423866:log-group:/aws/lambda/modl-sdk-upload-lambda:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "modl-sdk-upload-lambda"
        name                  = "modl-sdk-upload-lambda"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 43 to add, 3 to change, 8 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

Pusher: @tannermpeterson